class Const
  CURRENCY = ['￥', '$', '€', '₽', '¥', '£', '₮'].freeze
  PRODUCT_NAME = ['УИХ-ын сонгуулийн санал хураалт энэ сарын 24-нд болно. Энэ удаагийн сонгуульд 14 нам, эвсэл  121 бие даагч гээд нийт 639 нэр дэвшигч өрсөлдөж байна',
                  'Сонгуулийн санал хураах үйл явцад иргэний нийгмийн ажиглагчид хөндлөнгийн хяналт тавихаар болсныг Шударга сонгуулийн төлөө иргэний нийгмийн хяналт сүлжээнээс өнөөдөр /2020.06.11/ мэдээлэв.',
                  'Энэ удаагийн ээлжит сонгуулиар нийслэлийн хэмжээнд 451 сонгуулийн хэсгийн хороо ажиллах юм. Үүнээс 100 хэсгийн хороонд иргэний нийгмийн 204 ажиглагч залуус санал хураалт эхлэхээс дуусах хүртэл хяналт тавихаар болжээ',
                  'Бренд',
                  '₽',
                  '₽'].freeze
  PRODUCT_INFO = ['5G бол өнөөгийн бидний хэрэглэж буй өндөр хурдны хөдөлгөөнт интернэтийн 4G/LTE үйлчилгээний дараагийн буюу 5 дахь үе юм. Хамгийн орчин үеийн дэвшилтэт технологийн хувьд дараах давуу талуудыг нь онцолж болно.',
                  'Юуны өмнө 5G технологийг аль хэдийн нэвтрүүлсэн Япон, АНУ, БНХАУ, Их Британи, Европын орнуудад ажиллаж, туршлага хуримтлуулсан хүний нүдээр харахад 5G нэвтрүүлэх төлөвлөгөө, хамрах хүрээний тэлэлт, 5G үйлчилгээний үнэ тариф гэх зэрэг маш олон сорилтууд бэлхнээ ажиглагдаж байсан юм.',
                  'Энэ чанж чанар нь өмнөтэйгээ адил бол тэр шинж чанараа сонгоно',
                  'Барааны хэмжээ',
                  'Дуусах хугацаа'].freeze

end
